using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;
using Word = Microsoft.Office.Interop.Word;
using Excel = Microsoft.Office.Interop.Excel;
using exportWord = Microsoft.Office.Interop.Word;
using Microsoft.Office.Interop.Word;
using Microsoft.Office.Interop.Excel;

namespace Integral_Figures
{
    public partial class twoFunctions : Form
    {
        double a; double b; double c; double a1; double b1; double c1; double a2; double b2; double c2; double disc; double x1; double x2; double Fa; double Fb; double Ga; double Gb; double Integral1; double Integral2; double Figure;
        public twoFunctions()
        {
            InitializeComponent();
        }
        private void Form3_Load(object sender, EventArgs e)
        {

        }
        private void button1_Click(object sender, KeyPressEventArgs e)
        {
            if ((e.KeyChar >= '0') && (e.KeyChar <= 9)) { return; }
            if (e.KeyChar == '.') { e.KeyChar = ','; }
            if (e.KeyChar == ',')
            {
                if (textBoxA1.Text.IndexOf(',') != -1) { e.Handled = true; }
                return;
                if (textBoxB1.Text.IndexOf(',') != -1) { e.Handled = true; }
                return;
                if (textBoxC1.Text.IndexOf(',') != -1) { e.Handled = true; }
                return;
                if (textBoxA2.Text.IndexOf(',') != -1) { e.Handled = true; }
                return;
                if (textBoxB2.Text.IndexOf(',') != -1) { e.Handled = true; }
                return;
                if (textBoxC2.Text.IndexOf(',') != -1) { e.Handled = true; }
                return;
            }
        }
        public void button1_Click(object sender, EventArgs e)
        {
            try
            {
                a1 = Convert.ToDouble(textBoxA1.Text);
                b1 = Convert.ToDouble(textBoxB1.Text);
                c1 = Convert.ToDouble(textBoxC1.Text);
                a2 = Convert.ToDouble(textBoxA2.Text);
                b2 = Convert.ToDouble(textBoxB2.Text);
                c2 = Convert.ToDouble(textBoxC2.Text);

                a = a1 - a2; b = b1 - b2; c = c1 - c2;
                if (a1 == 0 && a2 == 0) { MessageBox.Show("Нельзя определить фигуру так как у функций только одна точка пересечения"); }
                disc = Math.Pow(b, 2) - 4 * a * c;
                if (disc < 0) { MessageBox.Show("Невозможно вычислить точки пересечения функций"); }
                else if (disc == 0) { MessageBox.Show("Нельзя определить фигуру так как у функций только одна точка пересечения"); }
                else if (disc > 0)
                {
                    x1 = ((-b - Math.Sqrt(disc)) / (2 * a));
                    x2 = ((-b + Math.Sqrt(disc)) / (2 * a));
                    if (x1 > x2)
                    {
                        Fa = (a1 * (Math.Pow(x2, 3) / 3)) + (b1 * (Math.Pow(x2, 2) / 2)) + (c1 * x2);
                        Fb = (a1 * (Math.Pow(x1, 3) / 3)) + (b1 * (Math.Pow(x1, 2) / 2)) + (c1 * x1);
                        Ga = (a2 * (Math.Pow(x2, 3) / 3)) + (b2 * (Math.Pow(x2, 2) / 2)) + (c2 * x2);
                        Gb = (a2 * (Math.Pow(x1, 3) / 3)) + (b2 * (Math.Pow(x1, 2) / 2)) + (c2 * x1);
                        Integral1 = Math.Abs(Fb - Fa);
                        Integral2 = Math.Abs(Gb - Ga);
                        Figure = Math.Abs(Integral1 - Integral2);

                        label9.Text = Figure + " ед";
                    }
                    else if (x1 < x2)
                    {
                        Fa = (a1 * (Math.Pow(x1, 3) / 3)) + (b1 * (Math.Pow(x1, 2) / 2)) + (c1 * x1);
                        Fb = (a1 * (Math.Pow(x2, 3) / 3)) + (b1 * (Math.Pow(x2, 2) / 2)) + (c1 * x2);
                        Ga = (a2 * (Math.Pow(x1, 3) / 3)) + (b2 * (Math.Pow(x1, 2) / 2)) + (c2 * x1);
                        Gb = (a2 * (Math.Pow(x2, 3) / 3)) + (b2 * (Math.Pow(x2, 2) / 2)) + (c2 * x2);
                        Integral1 = Math.Abs(Fb - Fa);
                        Integral2 = Math.Abs(Gb - Ga);
                        Figure = Integral1 - Integral2;

                        label9.Text = Figure.ToString() + " ед";
                    }
                }
            }
            catch { MessageBox.Show("Некорректный ввод данных"); }
        }
        private void button2_Click(object sender, EventArgs e)
        {
            if (x1 > x2)
            {
                if (a1 != 0 && b1 != 0 && c1 != 0 && a2 != 0 && b2 != 0 && c2 != 0) //a b c = a b c ; x2 = a ; x1 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " + " + b1 + "x" + " + " + c1 + " = " + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + "\n" +
                    a1 + "x^2" + " - " + a2 + "x^2" + " + " + b1 + "x" + " - " + b2 + "x" + " + " + c1 + " - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + " + " + c1 + ")dx  и  " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + " + " + c1 + ")dx = (" + a1 + " * x^3) / 3 + (" + b1 + " * x^2) / 2 + " + c1 + "x   " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + ")dx = (" + a2 + " * x^3) / 3 + (" + b2 + " * x^2) / 2 + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3 + (" + b1 + " * " + x2 + "^2) / 2 + " + c1 + " * " + x2 + " = " + Fa + "   (" + a2 + " * " + x2 + "^3) / 3 + (" + b2 + " * " + x2 + "^2) / 2 + " + c2 + " * " + x2 + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3 + (" + b1 + " * " + x1 + "^2) / 2 + " + c1 + " * " + x1 + " = " + Fb + "   (" + a2 + " * " + x1 + "^3) / 3 + (" + b2 + " * " + x1 + "^2) / 2 + " + c2 + " * " + x1 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 != 0 && c1 != 0 && a2 != 0 && b2 != 0 && c2 == 0) //a b c = a b 0 ; x2 = a ; x1 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " + " + b1 + "x" + " + " + c1 + " = " + a2 + "x^2" + " + " + b2 + "x" + " + " + "\n" +
                    a1 + "x^2" + " - " + a2 + "x^2" + " + " + b1 + "x" + " - " + b2 + "x" + " + " + c1 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + " + " + c1 + ")dx  и  " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + " + " + c1 + ")dx = (" + a1 + " * x^3) / 3 + (" + b1 + " * x^2) / 2 + " + c1 + "x   " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + ")dx = (" + a2 + " * x^3) / 3 + (" + b2 + " * x^2) / 2 + " + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3 + (" + b1 + " * " + x2 + "^2) / 2 + " + c1 + " * " + x2 + " = " + Fa + "   (" + a2 + " * " + x2 + "^3) / 3 + (" + b2 + " * " + x2 + "^2) / 2 + " + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3 + (" + b1 + " * " + x1 + "^2) / 2 + " + c1 + " * " + x1 + " = " + Fb + "   (" + a2 + " * " + x1 + "^3) / 3 + (" + b2 + " * " + x1 + "^2) / 2 + " + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 != 0 && c1 != 0 && a2 != 0 && b2 == 0 && c2 != 0) //a b c = a 0 c ; x2 = a ; x1 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " + " + b1 + "x" + " + " + c1 + " = " + a2 + "x^2" + " + " + c2 + "\n" +
                    a1 + "x^2" + " - " + a2 + "x^2" + " + " + b1 + "x" + " + " + c1 + " - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + " + " + c1 + ")dx  и  " + "∫(" + a2 + "x^2" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + " + " + c1 + ")dx = (" + a1 + " * x^3) / 3 + (" + b1 + " * x^2) / 2 + " + c1 + "x   " + "∫(" + a2 + "x^2" + " + " + c2 + ")dx = (" + a2 + " * x^3) / 3 + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3 + (" + b1 + " * " + x2 + "^2) / 2 + " + c1 + " * " + x2 + " = " + Fa + "   (" + a2 + " * " + x2 + "^3) / 3 + " + c2 + " * " + x2 + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3 + (" + b1 + " * " + x1 + "^2) / 2 + " + c1 + " * " + x1 + " = " + Fb + "   (" + a2 + " * " + x1 + "^3) / 3 + " + c2 + " * " + x1 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 != 0 && c1 != 0 && a2 == 0 && b2 != 0 && c2 != 0) //a b c = 0 b c  ; x2 = a ; x1 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " + " + b1 + "x" + " + " + c1 + " = " + b2 + "x" + " + " + c2 + "\n" +
                    a1 + "x^2" + " + " + b1 + "x" + " - " + b2 + "x" + " + " + c1 + " - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + " + " + c1 + ")dx  и  " + "∫(" + b2 + "x" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + " + " + c1 + ")dx = (" + a1 + " * x^3) / 3 + (" + b1 + " * x^2) / 2 + " + c1 + "x   " + "∫(" + b2 + "x" + " + " + c2 + ")dx = (" + b2 + " * x^2) / 2 + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3 + (" + b1 + " * " + x2 + "^2) / 2 + " + c1 + " * " + x2 + " = " + Fa + "   (" + b2 + " * " + x2 + "^2) / 2 + " + c2 + " * " + x2 + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3 + (" + b1 + " * " + x1 + "^2) / 2 + " + c1 + " * " + x1 + " = " + Fb + "   (" + b2 + " * " + x1 + "^2) / 2 + " + c2 + " * " + x1 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 != 0 && c1 != 0 && a2 != 0 && b2 == 0 && c2 == 0) // a b c = a 0 0  ; x2 = a ; x1 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " + " + b1 + "x" + " + " + c1 + " = " + a2 + "x^2" + "\n" +
                    a1 + "x^2" + " - " + a2 + "x^2" + " + " + b1 + "x" + " - 0" + " + " + c1 + " - 0" + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + " + " + c1 + ")dx  и  " + "∫" + a2 + "x^2" + " dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + " + " + c1 + ")dx = (" + a1 + " * x^3) / 3 + (" + b1 + " * x^2) / 2 + " + c1 + "x   " + "∫" + a2 + "x^2 dx = (" + a2 + " * x^3) / 3 \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3 + (" + b1 + " * " + x2 + "^2) / 2 + " + c1 + " * " + x2 + " = " + Fa + "   (" + a2 + " * " + x2 + "^3) / 3 = " + Ga + "\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3 + (" + b1 + " * " + x1 + "^2) / 2 + " + c1 + " * " + x1 + " = " + Fb + "   (" + a2 + " * " + x1 + "^3) / 3 = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 != 0 && c1 != 0 && a2 == 0 && b2 != 0 && c2 == 0) // a b c = 0 b 0 ; x2 = a ; x1 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " + " + b1 + "x" + " + " + c1 + " = " + b2 + "x" + "\n" +
                    a1 + "x^2" + " - 0" + " + " + b1 + "x" + " - " + b2 + "x" + " + " + c1 + " - 0" + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + " + " + c1 + ")dx  и  " + "∫" + b2 + "x" + " dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + " + " + c1 + ")dx = (" + a1 + " * x^3) / 3 + (" + b1 + " * x^2) / 2 + " + c1 + "x   " + "∫" + b2 + "x" + " dx = (" + b2 + " * x^2) / 2 +" + "\n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3 + (" + b1 + " * " + x2 + "^2) / 2 + " + c1 + " * " + x2 + " = " + Fa + "   (" + b2 + " * " + x2 + "^2) / 2 = " + Ga + "\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3 + (" + b1 + " * " + x1 + "^2) / 2 + " + c1 + " * " + x1 + " = " + Fb + "   (" + b2 + " * " + x1 + "^2) / 2 = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +

                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 != 0 && c1 != 0 && a2 == 0 && b2 == 0 && c2 != 0) // a b c = 0 0 c ; x2 = a ; x1 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " + " + b1 + "x" + " + " + c1 + " = " + c2 + "\n" +
                    a1 + "x^2" + " - 0" + " + " + b1 + "x" + " - 0" + " + " + c1 + " - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + " + " + c1 + ")dx  и  " + "∫" + c2 + " dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + " + " + c1 + ")dx = (" + a1 + " * x^3) / 3 + (" + b1 + " * x^2) / 2 + " + c1 + "x   " + "∫" + c2 + " dx = " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3 + (" + b1 + " * " + x2 + "^2) / 2 + " + c1 + " * " + x2 + " = " + Fa + "    " + c2 + " * " + x2 + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3 + (" + b1 + " * " + x1 + "^2) / 2 + " + c1 + " * " + x1 + " = " + Fb + "    " + c2 + " * " + x1 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 != 0 && c1 == 0 && a2 != 0 && b2 != 0 && c2 != 0) //a b 0 = a b c ; x2 = a ; x1 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " + " + b1 + "x" + " = " + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + "\n" +
                    a1 + "x^2" + " - " + a2 + "x^2" + " + " + b1 + "x" + " - " + b2 + "x" + " + " + "0 - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + ")dx  и  " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + ")dx = (" + a1 + " * x^3) / 3 + (" + b1 + " * x^2) / 2" + "   " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + ")dx = (" + a2 + " * x^3) / 3 + (" + b2 + " * x^2) / 2 + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3 + (" + b1 + " * " + x2 + "^2) / 2" + " = " + Fa + "   (" + a2 + " * " + x2 + "^3) / 3 + (" + b2 + " * " + x2 + "^2) / 2 + " + c2 + " * " + x2 + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3 + (" + b1 + " * " + x1 + "^2) / 2" + " = " + Fb + "   (" + a2 + " * " + x1 + "^3) / 3 + (" + b2 + " * " + x1 + "^2) / 2 + " + c2 + " * " + x1 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 != 0 && c1 == 0 && a2 != 0 && b2 != 0 && c2 == 0) // a b 0 = a b 0  ; x2 = a ; x1 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " + " + b1 + "x" + " = " + a2 + "x^2" + " + " + b2 + "x" + "\n" +
                    a1 + "x^2" + " - " + a2 + "x^2" + " + " + b1 + "x" + " - " + b2 + "x" + "\n" +
                    a + "x^2" + " + " + b + "x + 0" + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * 0" + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + ")dx  и  " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + ")dx = (" + a1 + " * x^3) / 3 + (" + b1 + " * x^2) / 2" + "   " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + ")dx = (" + a2 + " * x^3) / 3 + (" + b2 + " * x^2) / 2 + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3 + (" + b1 + " * " + x2 + "^2) / 2" + " = " + Fa + "   (" + a2 + " * " + x2 + "^3) / 3 + (" + b2 + " * " + x2 + "^2) / 2 + " + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3 + (" + b1 + " * " + x1 + "^2) / 2" + " = " + Fb + "   (" + a2 + " * " + x1 + "^3) / 3 + (" + b2 + " * " + x1 + "^2) / 2 + " + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 != 0 && c1 == 0 && a2 != 0 && b2 == 0 && c2 != 0) // a b 0 = a 0 c ; x2 = a ; x1 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " + " + b1 + "x" + " = " + a2 + "x^2" + " + " + c2 + "\n" +
                    a1 + "x^2" + " - " + a2 + "x^2" + " + " + b1 + "x" + " - 0" + " + " + "0 - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + ")dx  и  " + "∫(" + a2 + "x^2" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + ")dx = (" + a1 + " * x^3) / 3 + (" + b1 + " * x^2) / 2" + "   " + "∫(" + a2 + "x^2" + " + " + c2 + ")dx = (" + a2 + " * x^3) / 3" + " + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3 + (" + b1 + " * " + x2 + "^2) / 2" + " = " + Fa + "   (" + a2 + " * " + x2 + "^3) / 3" + " + " + c2 + " * " + x2 + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3 + (" + b1 + " * " + x1 + "^2) / 2" + " = " + Fb + "   (" + a2 + " * " + x1 + "^3) / 3" + " + " + c2 + " * " + x1 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 != 0 && c1 == 0 && a2 == 0 && b2 != 0 && c2 != 0) //a b 0 = 0 b c ; x2 = a ; x1 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " + " + b1 + "x" + " = " + b2 + "x" + " + " + c2 + "\n" +
                    a1 + "x^2" + " - 0" + " + " + b1 + "x" + " - " + b2 + "x" + " + " + "0 - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + ")dx  и  " + "∫(" + b2 + "x" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + ")dx = (" + a1 + " * x^3) / 3 + (" + b1 + " * x^2) / 2" + "   " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + ")dx = " + "(" + b2 + " * x^2) / 2 + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3 + (" + b1 + " * " + x2 + "^2) / 2" + " = " + Fa + "   " + "(" + b2 + " * " + x2 + "^2) / 2 + " + c2 + " * " + x2 + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3 + (" + b1 + " * " + x1 + "^2) / 2" + " = " + Fb + "   " + "(" + b2 + " * " + x1 + "^2) / 2 + " + c2 + " * " + x1 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 != 0 && c1 == 0 && a2 != 0 && b2 == 0 && c2 == 0) //a b 0 = a 0 0 ; x2 = a ; x1 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " + " + b1 + "x" + " = " + a2 + "x^2" + "\n" +
                    a1 + "x^2" + " - " + a2 + "x^2" + " + " + "0 - 0" + " + " + "0 - 0" + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + ")dx  и  " + "∫(" + a2 + "x^2" + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + ")dx = (" + a1 + " * x^3) / 3 + (" + b1 + " * x^2) / 2 + " + "   " + "∫" + a2 + "x^2" + "dx = (" + a2 + " * x^3) / 3" + "\n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3 + (" + b1 + " * " + x2 + "^2) / 2" + " = " + Fa + "   (" + a2 + " * " + x2 + "^3) / 3" + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3 + (" + b1 + " * " + x1 + "^2) / 2" + " = " + Fb + "   (" + a2 + " * " + x1 + "^3) / 3" + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 != 0 && c1 == 0 && a2 == 0 && b2 != 0 && c2 == 0) //a b 0 = 0 b 0 ; x2 = a ; x1 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " + " + b1 + "x" + " = " + b2 + "x" + "\n" +
                    a1 + "x^2" + " - 0" + " + " + b1 + "x" + " - " + b2 + "x" + " + " + "0 - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + ")dx  и  " + "∫(" + b2 + "x" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + ")dx = (" + a1 + " * x^3) / 3 + (" + b1 + " * x^2) / 2" + "   " + "∫" + b2 + "x" + "dx = " + "(" + b2 + " * x^2) / 2" + "\n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3 + (" + b1 + " * " + x2 + "^2) / 2" + " = " + Fa + "   " + "(" + b2 + " * " + x2 + "^2) / 2" + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3 + (" + b1 + " * " + x1 + "^2) / 2" + " = " + Fb + "   " + "(" + b2 + " * " + x1 + "^2) / 2" + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 != 0 && c1 == 0 && a2 == 0 && b2 == 0 && c2 != 0) //a b 0 = 0 0 c ; x2 = a ; x1 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " + " + b1 + "x" + " = " + c2 + "\n" +
                    a1 + "x^2" + " - 0" + " + " + b1 + "x" + " - 0" + " + " + "0 - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + ")dx  и  " + "∫" + c2 + "dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + ")dx = (" + a1 + " * x^3) / 3 + (" + b1 + " * x^2) / 2" + "   " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + ")dx = " + "(" + b2 + " * x^2) / 2 + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3 + (" + b1 + " * " + x2 + "^2) / 2" + " = " + Fa + "   " + c2 + " * " + x2 + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3 + (" + b1 + " * " + x1 + "^2) / 2" + " = " + Fb + "   " + c2 + " * " + x1 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 == 0 && c1 != 0 && a2 != 0 && b2 != 0 && c2 != 0) //a 0 c = a b c ; x2 = a ; x1 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " + " + c1 + " = " + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + "\n" +
                    a1 + "x^2" + " - " + a2 + "x^2" + " + " + "0 - " + b2 + "x" + " + " + c1 + " - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + a1 + "x^2" + " + " + c1 + ")dx  и  " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + a1 + "x^2" + " + " + c1 + ")dx = (" + a1 + " * x^3) / 3" + " + " + c1 + "x   " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + ")dx = (" + a2 + " * x^3) / 3 + (" + b2 + " * x^2) / 2 + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3" + " + " + c1 + " * " + x2 + " = " + Fa + "   (" + a2 + " * " + x2 + "^3) / 3 + (" + b2 + " * " + x2 + "^2) / 2 + " + c2 + " * " + x2 + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3" + " + " + c1 + " * " + x1 + " = " + Fb + "   (" + a2 + " * " + x1 + "^3) / 3 + (" + b2 + " * " + x1 + "^2) / 2 + " + c2 + " * " + x1 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 == 0 && c1 != 0 && a2 != 0 && b2 != 0 && c2 == 0) //a 0 c = a b 0 ; x2 = a ; x1 = b //
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " + " + c1 + " = " + a2 + "x^2" + " + " + b2 + "x" + "\n" +
                    a1 + "x^2" + " - " + a2 + "x^2" + " + " + "0 - " + b2 + "x" + " + " + c1 + " - 0" + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + a1 + "x^2" + " + " + c1 + ")dx  и  " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + a1 + "x^2" + " + " + c1 + ")dx = (" + a1 + " * x^3) / 3" + " + " + c1 + "x   " + "∫(" + a2 + "x^2" + " + " + b2 + ")dx = (" + a2 + " * x^3) / 3 + (" + b2 + " * x^2) / 2" + "\n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3" + " + " + c1 + " * " + x2 + " = " + Fa + "   (" + a2 + " * " + x2 + "^3) / 3 + (" + b2 + " * " + x2 + "^2) / 2" + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3" + " + " + c1 + " * " + x1 + " = " + Fb + "   (" + a2 + " * " + x1 + "^3) / 3 + (" + b2 + " * " + x1 + "^2) / 2" + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 == 0 && c1 != 0 && a2 != 0 && b2 == 0 && c2 != 0) //a 0 c = a 0 c ; x2 = a ; x1 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " + " + c1 + " = " + a2 + "x^2" + " + " + c2 + "\n" +
                    a1 + "x^2" + " - " + a2 + "x^2" + " + " + "0 - 0" + " + " + c1 + " - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + a1 + "x^2" + " + " + c1 + ")dx  и  " + "∫(" + a2 + "x^2" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + a1 + "x^2" + " + " + c1 + ")dx = (" + a1 + " * x^3) / 3" + " + " + c1 + "x   " + "∫(" + a2 + "x^2" + " + " + c2 + ")dx = (" + a2 + " * x^3) / 3" + " + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3" + " + " + c1 + " * " + x2 + " = " + Fa + "   (" + a2 + " * " + x2 + "^3) / 3" + " + " + c2 + " * " + x2 + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3" + " + " + c1 + " * " + x1 + " = " + Fb + "   (" + a2 + " * " + x1 + "^3) / 3" + " + " + c2 + " * " + x1 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 == 0 && c1 != 0 && a2 == 0 && b2 != 0 && c2 != 0) //a 0 c = 0 b c ; x2 = a ; x1 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " + " + c1 + " = " + b2 + "x" + " + " + c2 + "\n" +
                    a1 + "x^2" + " - 0" + " + " + "0 - " + b2 + "x" + " + " + c1 + " - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + a1 + "x^2" + " + " + c1 + ")dx  и  " + "∫(" + b2 + "x" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + a1 + "x^2" + " + " + c1 + ")dx = (" + a1 + " * x^3) / 3" + " + " + c1 + "x   " + "∫(" + b2 + "x" + " + " + c2 + ")dx = " + "(" + b2 + " * x^2) / 2 + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3" + " + " + c1 + " * " + x2 + " = " + Fa + "   " + "(" + b2 + " * " + x2 + "^2) / 2 + " + c2 + " * " + x2 + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3" + " + " + c1 + " * " + x1 + " = " + Fb + "   " + "(" + b2 + " * " + x1 + "^2) / 2 + " + c2 + " * " + x1 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 == 0 && c1 != 0 && a2 != 0 && b2 == 0 && c2 == 0) //a 0 c = a 0 0 ; x2 = a ; x1 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " + " + c1 + " = " + a2 + "x^2" + "\n" +
                    a1 + "x^2" + " - " + a2 + "x^2" + " + " + "0 - 0" + " + " + c1 + " - 0" + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + a1 + "x^2" + " + " + c1 + ")dx  и  " + "∫" + a2 + "x^2" + "dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + a1 + "x^2" + " + " + c1 + ")dx = (" + a1 + " * x^3) / 3" + " + " + c1 + "x   " + "∫" + a2 + "x^2" + "dx = (" + a2 + " * x^3) / 3" + "\n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3" + " + " + c1 + " * " + x2 + " = " + Fa + "   (" + a2 + " * " + x2 + "^3) / 3" + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3" + " + " + c1 + " * " + x1 + " = " + Fb + "   (" + a2 + " * " + x1 + "^3) / 3" + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 == 0 && c1 != 0 && a2 == 0 && b2 != 0 && c2 == 0) //a 0 c = 0 b 0 ; x2 = a ; x1 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " + " + c1 + " = " + c2 + "\n" +
                    a1 + "x^2" + " - 0" + " + " + "0 - " + b2 + "x" + " + " + c1 + " - 0" + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + a1 + "x^2" + " + " + c1 + ")dx  и  " + "∫" + b2 + "x" + "dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + a1 + "x^2" + " + " + c1 + ")dx = (" + a1 + " * x^3) / 3" + " + " + c1 + "x   " + "∫" + b2 + "x" + "dx = " + "(" + b2 + " * x^2) / 2 + " + "\n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3" + " + " + c1 + " * " + x2 + " = " + Fa + "   " + "(" + b2 + " * " + x2 + "^2) / 2" + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3" + " + " + c1 + " * " + x1 + " = " + Fb + "   " + "(" + b2 + " * " + x1 + "^2) / 2" + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 == 0 && c1 != 0 && a2 == 0 && b2 == 0 && c2 != 0) //a 0 c = 0 0 c ; x2 = a ; x1 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " + " + c1 + " = " + c2 + "\n" +
                    a1 + "x^2" + " - 0" + " + " + "0 - 0" + " + " + c1 + " - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + a1 + "x^2" + " + " + c1 + ")dx  и  " + "∫" + c2 + "dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + a1 + "x^2" + " + " + c1 + ")dx = (" + a1 + " * x^3) / 3" + " + " + c1 + "x   " + "∫" + c2 + "dx = " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3" + " + " + c1 + " * " + x2 + " = " + Fa + "   " + c2 + " * " + x2 + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3" + " + " + c1 + " * " + x1 + " = " + Fb + "   " + c2 + " * " + x1 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 == 0 && c1 == 0 && a2 != 0 && b2 != 0 && c2 != 0) // a 0 0 = a b c  ; x2 = a ; x1 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " = " + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + "\n" +
                    a1 + "x^2" + " - " + a2 + "x^2" + " + " + "0 - " + b2 + "x" + " + " + "0 - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫" + a1 + "x^2" + "dx  и  " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫" + a1 + "x^2" + "dx = (" + a1 + " * x^3) / 3" + "   " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + ")dx = (" + a2 + " * x^3) / 3 + (" + b2 + " * x^2) / 2 + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3" + " = " + Fa + "   (" + a2 + " * " + x2 + "^3) / 3 + (" + b2 + " * " + x2 + "^2) / 2 + " + c2 + " * " + x2 + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3" + " = " + Fb + "   (" + a2 + " * " + x1 + "^3) / 3 + (" + b2 + " * " + x1 + "^2) / 2 + " + c2 + " * " + x1 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 == 0 && c1 == 0 && a2 != 0 && b2 != 0 && c2 == 0) // a 0 0 = a b 0  ; x2 = a ; x1 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " = " + a2 + "x^2" + " + " + b2 + "x" + "\n" +
                    a1 + "x^2" + " - " + a2 + "x^2" + " + " + "0 - " + b2 + "x" + " + " + "0 - 0" + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫" + a1 + "x^2" + "dx  и  " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫" + a1 + "x^2" + "dx = (" + a1 + " * x^3) / 3" + "   " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + ")dx = (" + a2 + " * x^3) / 3 + (" + b2 + " * x^2) / 2" + "\n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3" + " = " + Fa + "   (" + a2 + " * " + x2 + "^3) / 3 + (" + b2 + " * " + x2 + "^2) / 2" + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3" + " = " + Fb + "   (" + a2 + " * " + x1 + "^3) / 3 + (" + b2 + " * " + x1 + "^2) / 2" + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 == 0 && c1 == 0 && a2 != 0 && b2 == 0 && c2 != 0) // a 0 0 = a 0 c  ; x2 = a ; x1 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " = " + a2 + "x^2" + " + " + c2 + "\n" +
                    a1 + "x^2" + " - " + a2 + "x^2" + " + " + "0 - 0" + " + " + "0 - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫" + a1 + "x^2" + "dx  и  " + "∫(" + a2 + "x^2" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫" + a1 + "x^2" + "dx = (" + a1 + " * x^3) / 3" + "   " + "∫(" + a2 + "x^2" + " + " + c2 + ")dx = (" + a2 + " * x^3) / 3" + " + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3" + " = " + Fa + "   (" + a2 + " * " + x2 + "^3) / 3" + " + " + c2 + " * " + x2 + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3" + " = " + Fb + "   (" + a2 + " * " + x1 + "^3) / 3" + " + " + c2 + " * " + x1 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 == 0 && c1 == 0 && a2 == 0 && b2 != 0 && c2 != 0) // a 0 0 = 0 b c  ; x2 = a ; x1 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " = " + b2 + "x" + " + " + c2 + "\n" +
                    a1 + "x^2" + " - 0" + " + " + "0 - " + b2 + "x" + " + " + "0 - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫" + a1 + "x^2" + "dx  и  " + "∫(" + b2 + "x" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫" + a1 + "x^2" + "dx = (" + a1 + " * x^3) / 3" + "   " + "∫(" + b2 + "x" + " + " + c2 + ")dx = " + "(" + b2 + " * x^2) / 2 + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3" + " = " + Fa + "   " + "(" + b2 + " * " + x2 + "^2) / 2 + " + c2 + " * " + x2 + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3" + " = " + Fb + "   " + "(" + b2 + " * " + x1 + "^2) / 2 + " + c2 + " * " + x1 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 == 0 && c1 == 0 && a2 != 0 && b2 == 0 && c2 == 0) // a 0 0 = a 0 0  ; x2 = a ; x1 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " = " + a2 + "x^2" + "\n" +
                    a1 + "x^2" + " - " + a2 + "x^2" + " + " + "0 - 0" + " + " + "0 - 0" + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫" + a1 + "x^2" + "dx  и  " + "∫" + a2 + "x^2" + "dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫" + a1 + "x^2" + "dx = (" + a1 + " * x^3) / 3" + "   " + "∫" + a2 + "x^2" + "dx = (" + a2 + " * x^3) / 3" + "\n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3" + " = " + Fa + "   (" + a2 + " * " + x2 + "^3) / 3" + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3" + " = " + Fb + "   (" + a2 + " * " + x1 + "^3) / 3" + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 == 0 && c1 == 0 && a2 == 0 && b2 != 0 && c2 == 0) // a 0 0 = 0 b 0  ; x2 = a ; x1 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " = " + b2 + "x" + "\n" +
                    a1 + "x^2" + " - 0" + " + " + "0 - " + b2 + "x" + " + " + "0 - 0" + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫" + a1 + "x^2" + "dx  и  " + "∫" + b2 + "x" + "dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫" + a1 + "x^2" + "dx = (" + a1 + " * x^3) / 3" + "   " + "∫" + b2 + "x" + "dx = " + "(" + b2 + " * x^2) / 2" + "\n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3" + " = " + Fa + "   " + "(" + b2 + " * " + x2 + "^2) / 2" + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3" + " = " + Fb + "   " + "(" + b2 + " * " + x1 + "^2) / 2" + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 == 0 && c1 == 0 && a2 == 0 && b2 == 0 && c2 != 0) // a 0 0 = 0 0 c  ; x2 = a ; x1 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " = " + c2 + "\n" +
                    a1 + "x^2" + " - 0" + " + " + "0 - 0" + " + " + "0 - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫" + a1 + "x^2" + "dx  и  " + "∫" + c2 + "dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫" + a1 + "x^2" + "dx = (" + a1 + " * x^3) / 3" + "   " + "∫" + b2 + "x" + "dx = " + "(" + b2 + " * x^2) / 2" + "\n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3" + " = " + Fa + "   " + " + (" + b2 + " * " + x2 + "^2) / 2" + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3" + " = " + Fb + "   " + " + (" + b2 + " * " + x1 + "^2) / 2" + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 == 0 && b1 != 0 && c1 != 0 && a2 != 0 && b2 != 0 && c2 != 0) // 0 b c = a b c ; x2 = a ; x1 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    b1 + "x" + " + " + c1 + " = " + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + "\n" +
                    "0 - " + a2 + "x^2" + " + " + b1 + "x" + " - " + b2 + "x" + " + " + c1 + " - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + b1 + "x" + " + " + c1 + ")dx  и  " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + b1 + "x" + " + " + c1 + ")dx = (" + b1 + " * x^2) / 2 + " + c1 + "x   " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + ")dx = (" + a2 + " * x^3) / 3 + (" + b2 + " * x^2) / 2 + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + b1 + " * " + x2 + "^2) / 2 + " + c1 + " * " + x2 + " = " + Fa + "   (" + a2 + " * " + x2 + "^3) / 3 + (" + b2 + " * " + x2 + "^2) / 2 + " + c2 + " * " + x2 + " = " + Ga + "\n" +
                    "(" + b1 + " * " + x1 + "^2) / 2 + " + c1 + " * " + x1 + " = " + Fb + "   (" + a2 + " * " + x1 + "^3) / 3 + (" + b2 + " * " + x1 + "^2) / 2 + " + c2 + " * " + x1 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 == 0 && b1 != 0 && c1 == 0 && a2 != 0 && b2 != 0 && c2 != 0) // 0 b 0 = a b c  ; x2 = a ; x1 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    b1 + "x" + " = " + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + "\n" +
                    "0 - " + a2 + "x^2" + " + " + b1 + "x" + " - " + b2 + "x" + " + " + "0 - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫" + b1 + "x" + "dx  и  " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫" + b1 + "x" + "dx = (" + b1 + " * x^2) / 2" + "   " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + ")dx = (" + a2 + " * x^3) / 3 + (" + b2 + " * x^2) / 2 + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + b1 + " * " + x2 + "^2) / 2 + " + " = " + Fa + "   (" + a2 + " * " + x2 + "^3) / 3 + (" + b2 + " * " + x2 + "^2) / 2 + " + c2 + " * " + x2 + " = " + Ga + "\n" +
                    "(" + b1 + " * " + x1 + "^2) / 2 + " + " = " + Fb + "   (" + a2 + " * " + x1 + "^3) / 3 + (" + b2 + " * " + x1 + "^2) / 2 + " + c2 + " * " + x1 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 == 0 && b1 == 0 && c1 != 0 && a2 != 0 && b2 != 0 && c2 != 0) // 0 0 c = a b c  ; x2 = a ; x1 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    c1 + " = " + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + "\n" +
                    "0 - " + a2 + "x^2" + " + " + "0 - " + b2 + "x" + " + " + c1 + " - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫" + c1 + "dx  и  " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫" + c1 + "dx = " + c1 + "x   " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + ")dx = (" + a2 + " * x^3) / 3 + (" + b2 + " * x^2) / 2 + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    c1 + " * " + x2 + " = " + Fa + "   (" + a2 + " * " + x2 + "^3) / 3 + (" + b2 + " * " + x2 + "^2) / 2 + " + c2 + " * " + x2 + " = " + Ga + "\n" +
                    c1 + " * " + x1 + " = " + Fb + "   (" + a2 + " * " + x1 + "^3) / 3 + (" + b2 + " * " + x1 + "^2) / 2 + " + c2 + " * " + x1 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 == 0 && b1 != 0 && c1 != 0 && a2 != 0 && b2 != 0 && c2 == 0) // 0 b c = a b 0 ; x2 = a ; x1 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    b1 + "x" + " + " + c1 + " = " + a2 + "x^2" + " + " + b2 + "x" + "\n" +
                    "0 - " + a2 + "x^2" + " + " + b1 + "x" + " - " + b2 + "x" + " + " + c1 + " - 0" + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + b1 + "x" + " + " + c1 + ")dx  и  " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + b1 + "x" + " + " + c1 + ")dx = (" + b1 + " * x^2) / 2 + " + c1 + "x   " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + ")dx = (" + a2 + " * x^3) / 3 + (" + b2 + " * x^2) / 2" + "\n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + b1 + " * " + x2 + "^2) / 2 + " + c1 + " * " + x2 + " = " + Fa + "   (" + a2 + " * " + x2 + "^3) / 3 + (" + b2 + " * " + x2 + "^2) / 2" + " = " + Ga + "\n" +
                    "(" + b1 + " * " + x1 + "^2) / 2 + " + c1 + " * " + x1 + " = " + Fb + "   (" + a2 + " * " + x1 + "^3) / 3 + (" + b2 + " * " + x1 + "^2) / 2" + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 == 0 && b1 != 0 && c1 == 0 && a2 != 0 && b2 != 0 && c2 == 0) // 0 b 0 = a b 0  ; x2 = a ; x1 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    b1 + "x" + " = " + a2 + "x^2" + " + " + b2 + "x" + "\n" +
                    "0 - " + a2 + "x^2" + " + " + b1 + "x" + " - " + b2 + "x" + " + " + "0 - 0" + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫" + b1 + "x" + "dx  и  " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫" + b1 + "x" + "dx = (" + b1 + " * x^2) / 2" + "   " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + ")dx = (" + a2 + " * x^3) / 3 + (" + b2 + " * x^2) / 2" + "\n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + b1 + " * " + x2 + "^2) / 2 + " + " = " + Fa + "   (" + a2 + " * " + x2 + "^3) / 3 + (" + b2 + " * " + x2 + "^2) / 2" + " = " + Ga + "\n" +
                    "(" + b1 + " * " + x1 + "^2) / 2 + " + " = " + Fb + "   (" + a2 + " * " + x1 + "^3) / 3 + (" + b2 + " * " + x1 + "^2) / 2" + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 == 0 && b1 == 0 && c1 != 0 && a2 != 0 && b2 != 0 && c2 != 0) // 0 0 c = a b 0  ; x2 = a ; x1 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    c1 + " = " + a2 + "x^2" + " + " + b2 + "x" + "\n" +
                    "0 - " + a2 + "x^2" + " + " + "0 - " + b2 + "x" + " + " + c1 + " - 0" + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫" + c1 + "dx  и  " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫" + c1 + "dx = " + c1 + "x   " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + ")dx = (" + a2 + " * x^3) / 3 + (" + b2 + " * x^2) / 2" + "\n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    c1 + " * " + x2 + " = " + Fa + "   (" + a2 + " * " + x2 + "^3) / 3 + (" + b2 + " * " + x2 + "^2) / 2" + " = " + Ga + "\n" +
                    c1 + " * " + x1 + " = " + Fb + "   (" + a2 + " * " + x1 + "^3) / 3 + (" + b2 + " * " + x1 + "^2) / 2" + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 == 0 && b1 != 0 && c1 != 0 && a2 != 0 && b2 == 0 && c2 != 0) // 0 b c = a 0 c ; x2 = a ; x1 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    b1 + "x" + " + " + c1 + " = " + a2 + "x^2" + " + " + c2 + "\n" +
                    "0 - " + a2 + "x^2" + " + " + b1 + "x" + " - 0" + " + " + c1 + " - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + b1 + "x" + " + " + c1 + ")dx  и  " + "∫(" + a2 + "x^2" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + b1 + "x" + " + " + c1 + ")dx = (" + b1 + " * x^2) / 2 + " + c1 + "x   " + "∫(" + a2 + "x^2" + " + " + c2 + ")dx = (" + a2 + " * x^3) / 3" + " + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + b1 + " * " + x2 + "^2) / 2 + " + c1 + " * " + x2 + " = " + Fa + "   (" + a2 + " * " + x2 + "^3) / 3" + " + " + c2 + " * " + x2 + " = " + Ga + "\n" +
                    "(" + b1 + " * " + x1 + "^2) / 2 + " + c1 + " * " + x1 + " = " + Fb + "   (" + a2 + " * " + x1 + "^3) / 3" + " + " + c2 + " * " + x1 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 == 0 && b1 != 0 && c1 == 0 && a2 != 0 && b2 == 0 && c2 != 0) // 0 b 0 = a 0 c  ; x2 = a ; x1 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    b1 + "x" + " = " + a2 + "x^2" + " + " + c2 + "\n" +
                    "0 - " + a2 + "x^2" + " + " + b1 + "x" + " - 0" + " + " + "0 - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫" + b1 + "x" + "dx  и  " + "∫(" + a2 + "x^2" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫" + b1 + "x" + "dx = (" + b1 + " * x^2) / 2" + "   " + "∫(" + a2 + "x^2" + " + " + c2 + ")dx = (" + a2 + " * x^3) / 3" + " + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + b1 + " * " + x2 + "^2) / 2 + " + " = " + Fa + "   (" + a2 + " * " + x2 + "^3) / 3" + " + " + c2 + " * " + x2 + " = " + Ga + "\n" +
                    "(" + b1 + " * " + x1 + "^2) / 2 + " + " = " + Fb + "   (" + a2 + " * " + x1 + "^3) / 3" + " + " + c2 + " * " + x1 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 == 0 && b1 == 0 && c1 != 0 && a2 != 0 && b2 == 0 && c2 != 0) // 0 0 c = a 0 c  ; x2 = a ; x1 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    c1 + " = " + a2 + "x^2" + " + " + c2 + "\n" +
                    "0 - " + a2 + "x^2" + " + " + "0 - 0" + " + " + c1 + " - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫" + c1 + "dx  и  " + "∫(" + a2 + "x^2" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫" + c1 + "dx = " + c1 + "x   " + "∫(" + a2 + "x^2" + " + " + c2 + ")dx = (" + a2 + " * x^3) / 3" + " + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    c1 + " * " + x2 + " = " + Fa + "   (" + a2 + " * " + x2 + "^3) / 3" + " + " + c2 + " * " + x2 + " = " + Ga + "\n" +
                    c1 + " * " + x1 + " = " + Fb + "   (" + a2 + " * " + x1 + "^3) / 3" + " + " + c2 + " * " + x1 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 == 0 && b1 != 0 && c1 != 0 && a2 == 0 && b2 != 0 && c2 != 0) // 0 b c = 0 b c ; x2 = a ; x1 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    b1 + "x" + " + " + c1 + " = " + b2 + "x" + " + " + c2 + "\n" +
                    "0 - 0" + " + " + b1 + "x" + " - " + b2 + "x" + " + " + c1 + " - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + b1 + "x" + " + " + c1 + ")dx  и  " + "∫(" + b2 + "x" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + b1 + "x" + " + " + c1 + ")dx = (" + b1 + " * x^2) / 2 + " + c1 + "x   " + "∫(" + b2 + "x" + " + " + c2 + ")dx = " + "(" + b2 + " * x^2) / 2 + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + b1 + " * " + x2 + "^2) / 2 + " + c1 + " * " + x2 + " = " + Fa + "   " + "(" + b2 + " * " + x2 + "^2) / 2 + " + c2 + " * " + x2 + " = " + Ga + "\n" +
                    "(" + b1 + " * " + x1 + "^2) / 2 + " + c1 + " * " + x1 + " = " + Fb + "   " + "(" + b2 + " * " + x1 + "^2) / 2 + " + c2 + " * " + x1 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 == 0 && b1 != 0 && c1 == 0 && a2 == 0 && b2 != 0 && c2 != 0) // 0 b 0 = 0 b c  ; x2 = a ; x1 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    b1 + "x" + " = " + " + " + b2 + "x" + " + " + c2 + "\n" +
                    "0 - 0" + " + " + b1 + "x" + " - " + b2 + "x" + " + " + "0 - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫" + b1 + "x" + "dx  и  " + "∫(" + b2 + "x" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫" + b1 + "x" + "dx = (" + b1 + " * x^2) / 2" + "   " + "∫(" + b2 + "x" + " + " + c2 + ")dx = " + "(" + b2 + " * x^2) / 2 + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + b1 + " * " + x2 + "^2) / 2 + " + " = " + Fa + "   " + "(" + b2 + " * " + x2 + "^2) / 2 + " + c2 + " * " + x2 + " = " + Ga + "\n" +
                    "(" + b1 + " * " + x1 + "^2) / 2 + " + " = " + Fb + "   " + "(" + b2 + " * " + x1 + "^2) / 2 + " + c2 + " * " + x1 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 == 0 && b1 == 0 && c1 != 0 && a2 == 0 && b2 != 0 && c2 != 0) // 0 0 c = 0 b c  ; x2 = a ; x1 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    c1 + " = " + b2 + "x" + " + " + c2 + "\n" +
                    "0 - 0" + " + " + "0 - " + b2 + "x" + " + " + c1 + " - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫" + c1 + "dx  и  " + "∫(" + b2 + "x" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫" + c1 + "dx = " + c1 + "x   " + "∫(" + b2 + "x" + " + " + c2 + ")dx = " + "(" + b2 + " * x^2) / 2 + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    c1 + " * " + x2 + " = " + Fa + "   " + "(" + b2 + " * " + x2 + "^2) / 2 + " + c2 + " * " + x2 + " = " + Ga + "\n" +
                    c1 + " * " + x1 + " = " + Fb + "   " + "(" + b2 + " * " + x1 + "^2) / 2 + " + c2 + " * " + x1 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 == 0 && b1 != 0 && c1 != 0 && a2 != 0 && b2 == 0 && c2 == 0) // 0 b c = a 0 0 ; x2 = a ; x1 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    b1 + "x" + " + " + c1 + " = " + a2 + "x^2" + "\n" +
                    "0 - " + a2 + "x^2" + " + " + b1 + "x" + " - 0" + " + " + c1 + " - 0" + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + b1 + "x" + " + " + c1 + ")dx  и  " + "∫" + a2 + "x^2" + "dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + b1 + "x" + " + " + c1 + ")dx = (" + b1 + " * x^2) / 2 + " + c1 + "x   " + "∫" + a2 + "x^2" + "dx = (" + a2 + " * x^3) / 3" + "\n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + b1 + " * " + x2 + "^2) / 2 + " + c1 + " * " + x2 + " = " + Fa + "   (" + a2 + " * " + x2 + "^3) / 3" + " = " + Ga + "\n" +
                    "(" + b1 + " * " + x1 + "^2) / 2 + " + c1 + " * " + x1 + " = " + Fb + "   (" + a2 + " * " + x1 + "^3) / 3" + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 == 0 && b1 != 0 && c1 == 0 && a2 != 0 && b2 == 0 && c2 == 0) // 0 b 0 = a 0 0  ; x2 = a ; x1 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    b1 + "x" + " = " + a2 + "x^2" + "\n" +
                    "0 - " + a2 + "x^2" + " + " + b1 + "x" + " - 0" + " + " + "0 - 0" + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫" + b1 + "x" + "dx  и  " + "∫" + a2 + "x^2" + "dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫" + b1 + "x" + "dx = (" + b1 + " * x^2) / 2" + "   " + "∫" + a2 + "x^2" + "dx = (" + a2 + " * x^3) / 3" + "\n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + b1 + " * " + x2 + "^2) / 2 + " + " = " + Fa + "   (" + a2 + " * " + x2 + "^3) / 3" + " + " + c2 + " * " + x2 + " = " + Ga + "\n" +
                    "(" + b1 + " * " + x1 + "^2) / 2 + " + " = " + Fb + "   (" + a2 + " * " + x1 + "^3) / 3" + " + " + c2 + " * " + x1 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 == 0 && b1 == 0 && c1 != 0 && a2 != 0 && b2 == 0 && c2 == 0) // 0 0 c = a 0 0  ; x2 = a ; x1 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    c1 + " = " + a2 + "x^2" + "\n" +
                    "0 - " + a2 + "x^2" + " + " + "0 - 0" + " + " + c1 + " - 0" + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫" + c1 + "dx  и  " + "∫" + a2 + "x^2" + "dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫" + c1 + "dx = " + c1 + "x   " + "∫" + a2 + "x^2" + "dx = (" + a2 + " * x^3) / 3" + "\n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    c1 + " * " + x2 + " = " + Fa + "   (" + a2 + " * " + x2 + "^3) / 3" + " = " + Ga + "\n" +
                    c1 + " * " + x1 + " = " + Fb + "   (" + a2 + " * " + x1 + "^3) / 3" + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
            }
            else if (x1 < x2)
            {
                if (a1 != 0 && b1 != 0 && c1 != 0 && a2 != 0 && b2 != 0 && c2 != 0) //a b c = a b c ; x1 = a ; x2 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " + " + b1 + "x" + " + " + c1 + " = " + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + "\n" +
                    a1 + "x^2" + " - " + a2 + "x^2" + " + " + b1 + "x" + " - " + b2 + "x" + " + " + c1 + " - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + " + " + c1 + ")dx  и  " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + " + " + c1 + ")dx = (" + a1 + " * x^3) / 3 + (" + b1 + " * x^2) / 2 + " + c1 + "x   " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + ")dx = (" + a2 + " * x^3) / 3 + (" + b2 + " * x^2) / 2 + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3 + (" + b1 + " * " + x1 + "^2) / 2 + " + c1 + " * " + x1 + " = " + Fa + "   (" + a2 + " * " + x1 + "^3) / 3 + (" + b2 + " * " + x1 + "^2) / 2 + " + c2 + " * " + x1 + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3 + (" + b1 + " * " + x2 + "^2) / 2 + " + c1 + " * " + x2 + " = " + Fb + "   (" + a2 + " * " + x2 + "^3) / 3 + (" + b2 + " * " + x2 + "^2) / 2 + " + c2 + " * " + x2 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 != 0 && c1 != 0 && a2 != 0 && b2 != 0 && c2 == 0) //a b c = a b 0 ; x1 = a ; x2 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " + " + b1 + "x" + " + " + c1 + " = " + a2 + "x^2" + " + " + b2 + "x" + " + " + "\n" +
                    a1 + "x^2" + " - " + a2 + "x^2" + " + " + b1 + "x" + " - " + b2 + "x" + " + " + c1 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + " + " + c1 + ")dx  и  " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + " + " + c1 + ")dx = (" + a1 + " * x^3) / 3 + (" + b1 + " * x^2) / 2 + " + c1 + "x   " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + ")dx = (" + a2 + " * x^3) / 3 + (" + b2 + " * x^2) / 2 + " + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3 + (" + b1 + " * " + x1 + "^2) / 2 + " + c1 + " * " + x1 + " = " + Fa + "   (" + a2 + " * " + x1 + "^3) / 3 + (" + b2 + " * " + x1 + "^2) / 2 + " + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3 + (" + b1 + " * " + x2 + "^2) / 2 + " + c1 + " * " + x2 + " = " + Fb + "   (" + a2 + " * " + x2 + "^3) / 3 + (" + b2 + " * " + x2 + "^2) / 2 + " + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 != 0 && c1 != 0 && a2 != 0 && b2 == 0 && c2 != 0) //a b c = a 0 c ; x1 = a ; x2 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " + " + b1 + "x" + " + " + c1 + " = " + a2 + "x^2" + " + " + c2 + "\n" +
                    a1 + "x^2" + " - " + a2 + "x^2" + " + " + b1 + "x" + " + " + c1 + " - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + " + " + c1 + ")dx  и  " + "∫(" + a2 + "x^2" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + " + " + c1 + ")dx = (" + a1 + " * x^3) / 3 + (" + b1 + " * x^2) / 2 + " + c1 + "x   " + "∫(" + a2 + "x^2" + " + " + c2 + ")dx = (" + a2 + " * x^3) / 3 + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3 + (" + b1 + " * " + x1 + "^2) / 2 + " + c1 + " * " + x1 + " = " + Fa + "   (" + a2 + " * " + x1 + "^3) / 3 + " + c2 + " * " + x1 + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3 + (" + b1 + " * " + x2 + "^2) / 2 + " + c1 + " * " + x2 + " = " + Fb + "   (" + a2 + " * " + x2 + "^3) / 3 + " + c2 + " * " + x2 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 != 0 && c1 != 0 && a2 == 0 && b2 != 0 && c2 != 0) //a b c = 0 b c  ; x1 = a ; x2 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " + " + b1 + "x" + " + " + c1 + " = " + b2 + "x" + " + " + c2 + "\n" +
                    a1 + "x^2" + " + " + b1 + "x" + " - " + b2 + "x" + " + " + c1 + " - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + " + " + c1 + ")dx  и  " + "∫(" + b2 + "x" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + " + " + c1 + ")dx = (" + a1 + " * x^3) / 3 + (" + b1 + " * x^2) / 2 + " + c1 + "x   " + "∫(" + b2 + "x" + " + " + c2 + ")dx = (" + b2 + " * x^2) / 2 + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3 + (" + b1 + " * " + x1 + "^2) / 2 + " + c1 + " * " + x1 + " = " + Fa + "   (" + b2 + " * " + x1 + "^2) / 2 + " + c2 + " * " + x1 + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3 + (" + b1 + " * " + x2 + "^2) / 2 + " + c1 + " * " + x2 + " = " + Fb + "   (" + b2 + " * " + x2 + "^2) / 2 + " + c2 + " * " + x2 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 != 0 && c1 != 0 && a2 != 0 && b2 == 0 && c2 == 0) // a b c = a 0 0  ; x1 = a ; x2 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " + " + b1 + "x" + " + " + c1 + " = " + a2 + "x^2" + "\n" +
                    a1 + "x^2" + " - " + a2 + "x^2" + " + " + b1 + "x" + " - 0" + " + " + c1 + " - 0" + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + " + " + c1 + ")dx  и  " + "∫" + a2 + "x^2" + " dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + " + " + c1 + ")dx = (" + a1 + " * x^3) / 3 + (" + b1 + " * x^2) / 2 + " + c1 + "x   " + "∫" + a2 + "x^2 dx = (" + a2 + " * x^3) / 3 \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3 + (" + b1 + " * " + x1 + "^2) / 2 + " + c1 + " * " + x1 + " = " + Fa + "   (" + a2 + " * " + x1 + "^3) / 3 = " + Ga + "\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3 + (" + b1 + " * " + x2 + "^2) / 2 + " + c1 + " * " + x2 + " = " + Fb + "   (" + a2 + " * " + x2 + "^3) / 3 = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 != 0 && c1 != 0 && a2 == 0 && b2 != 0 && c2 == 0) // a b c = 0 b 0 ; x1 = a ; x2 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " + " + b1 + "x" + " + " + c1 + " = " + b2 + "x" + "\n" +
                    a1 + "x^2" + " - 0" + " + " + b1 + "x" + " - " + b2 + "x" + " + " + c1 + " - 0" + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + " + " + c1 + ")dx  и  " + "∫" + b2 + "x" + " dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + " + " + c1 + ")dx = (" + a1 + " * x^3) / 3 + (" + b1 + " * x^2) / 2 + " + c1 + "x   " + "∫" + b2 + "x" + " dx = (" + b2 + " * x^2) / 2 +" + "\n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3 + (" + b1 + " * " + x1 + "^2) / 2 + " + c1 + " * " + x1 + " = " + Fa + "   (" + b2 + " * " + x1 + "^2) / 2 = " + Ga + "\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3 + (" + b1 + " * " + x2 + "^2) / 2 + " + c1 + " * " + x2 + " = " + Fb + "   (" + b2 + " * " + x2 + "^2) / 2 = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +

                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 != 0 && c1 != 0 && a2 == 0 && b2 == 0 && c2 != 0) // a b c = 0 0 c ; x1 = a ; x2 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " + " + b1 + "x" + " + " + c1 + " = " + c2 + "\n" +
                    a1 + "x^2" + " - 0" + " + " + b1 + "x" + " - 0" + " + " + c1 + " - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + " + " + c1 + ")dx  и  " + "∫" + c2 + " dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + " + " + c1 + ")dx = (" + a1 + " * x^3) / 3 + (" + b1 + " * x^2) / 2 + " + c1 + "x   " + "∫" + c2 + " dx = " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3 + (" + b1 + " * " + x1 + "^2) / 2 + " + c1 + " * " + x1 + " = " + Fa + "    " + c2 + " * " + x1 + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3 + (" + b1 + " * " + x2 + "^2) / 2 + " + c1 + " * " + x2 + " = " + Fb + "    " + c2 + " * " + x2 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 != 0 && c1 == 0 && a2 != 0 && b2 != 0 && c2 != 0) //a b 0 = a b c ; x1 = a ; x2 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " + " + b1 + "x" + " = " + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + "\n" +
                    a1 + "x^2" + " - " + a2 + "x^2" + " + " + b1 + "x" + " - " + b2 + "x" + " + " + "0 - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + ")dx  и  " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + ")dx = (" + a1 + " * x^3) / 3 + (" + b1 + " * x^2) / 2" + "   " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + ")dx = (" + a2 + " * x^3) / 3 + (" + b2 + " * x^2) / 2 + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3 + (" + b1 + " * " + x1 + "^2) / 2" + " = " + Fa + "   (" + a2 + " * " + x1 + "^3) / 3 + (" + b2 + " * " + x1 + "^2) / 2 + " + c2 + " * " + x1 + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3 + (" + b1 + " * " + x2 + "^2) / 2" + " = " + Fb + "   (" + a2 + " * " + x2 + "^3) / 3 + (" + b2 + " * " + x2 + "^2) / 2 + " + c2 + " * " + x2 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 != 0 && c1 == 0 && a2 != 0 && b2 != 0 && c2 == 0) // a b 0 = a b 0  ; x1 = a ; x2 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " + " + b1 + "x" + " = " + a2 + "x^2" + " + " + b2 + "x" + "\n" +
                    a1 + "x^2" + " - " + a2 + "x^2" + " + " + b1 + "x" + " - " + b2 + "x" + "\n" +
                    a + "x^2" + " + " + b + "x + 0" + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * 0" + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + ")dx  и  " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + ")dx = (" + a1 + " * x^3) / 3 + (" + b1 + " * x^2) / 2" + "   " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + ")dx = (" + a2 + " * x^3) / 3 + (" + b2 + " * x^2) / 2 + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3 + (" + b1 + " * " + x1 + "^2) / 2" + " = " + Fa + "   (" + a2 + " * " + x1 + "^3) / 3 + (" + b2 + " * " + x1 + "^2) / 2 + " + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3 + (" + b1 + " * " + x2 + "^2) / 2" + " = " + Fb + "   (" + a2 + " * " + x2 + "^3) / 3 + (" + b2 + " * " + x2 + "^2) / 2 + " + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 != 0 && c1 == 0 && a2 != 0 && b2 == 0 && c2 != 0) // a b 0 = a 0 c ; x1 = a ; x2 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " + " + b1 + "x" + " = " + a2 + "x^2" + " + " + c2 + "\n" +
                    a1 + "x^2" + " - " + a2 + "x^2" + " + " + b1 + "x" + " - 0" + " + " + "0 - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + ")dx  и  " + "∫(" + a2 + "x^2" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + ")dx = (" + a1 + " * x^3) / 3 + (" + b1 + " * x^2) / 2" + "   " + "∫(" + a2 + "x^2" + " + " + c2 + ")dx = (" + a2 + " * x^3) / 3" + " + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3 + (" + b1 + " * " + x1 + "^2) / 2" + " = " + Fa + "   (" + a2 + " * " + x1 + "^3) / 3" + " + " + c2 + " * " + x1 + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3 + (" + b1 + " * " + x2 + "^2) / 2" + " = " + Fb + "   (" + a2 + " * " + x2 + "^3) / 3" + " + " + c2 + " * " + x2 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 != 0 && c1 == 0 && a2 == 0 && b2 != 0 && c2 != 0) //a b 0 = 0 b c ; x1 = a ; x2 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " + " + b1 + "x" + " = " + b2 + "x" + " + " + c2 + "\n" +
                    a1 + "x^2" + " - 0" + " + " + b1 + "x" + " - " + b2 + "x" + " + " + "0 - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + ")dx  и  " + "∫(" + b2 + "x" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + ")dx = (" + a1 + " * x^3) / 3 + (" + b1 + " * x^2) / 2" + "   " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + ")dx = " + "(" + b2 + " * x^2) / 2 + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3 + (" + b1 + " * " + x1 + "^2) / 2" + " = " + Fa + "   " + "(" + b2 + " * " + x1 + "^2) / 2 + " + c2 + " * " + x1 + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3 + (" + b1 + " * " + x2 + "^2) / 2" + " = " + Fb + "   " + "(" + b2 + " * " + x2 + "^2) / 2 + " + c2 + " * " + x2 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 != 0 && c1 == 0 && a2 != 0 && b2 == 0 && c2 == 0) //a b 0 = a 0 0 ; x1 = a ; x2 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " + " + b1 + "x" + " = " + a2 + "x^2" + "\n" +
                    a1 + "x^2" + " - " + a2 + "x^2" + " + " + "0 - 0" + " + " + "0 - 0" + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + ")dx  и  " + "∫(" + a2 + "x^2" + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + ")dx = (" + a1 + " * x^3) / 3 + (" + b1 + " * x^2) / 2 + " + "   " + "∫" + a2 + "x^2" + "dx = (" + a2 + " * x^3) / 3" + "\n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3 + (" + b1 + " * " + x1 + "^2) / 2" + " = " + Fa + "   (" + a2 + " * " + x1 + "^3) / 3" + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3 + (" + b1 + " * " + x2 + "^2) / 2" + " = " + Fb + "   (" + a2 + " * " + x2 + "^3) / 3" + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 != 0 && c1 == 0 && a2 == 0 && b2 != 0 && c2 == 0) //a b 0 = 0 b 0 ; x1 = a ; x2 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " + " + b1 + "x" + " = " + b2 + "x" + "\n" +
                    a1 + "x^2" + " - 0" + " + " + b1 + "x" + " - " + b2 + "x" + " + " + "0 - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + ")dx  и  " + "∫(" + b2 + "x" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + ")dx = (" + a1 + " * x^3) / 3 + (" + b1 + " * x^2) / 2" + "   " + "∫" + b2 + "x" + "dx = " + "(" + b2 + " * x^2) / 2" + "\n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3 + (" + b1 + " * " + x1 + "^2) / 2" + " = " + Fa + "   " + "(" + b2 + " * " + x1 + "^2) / 2" + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3 + (" + b1 + " * " + x2 + "^2) / 2" + " = " + Fb + "   " + "(" + b2 + " * " + x2 + "^2) / 2" + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 != 0 && c1 == 0 && a2 == 0 && b2 == 0 && c2 != 0) //a b 0 = 0 0 c ; x1 = a ; x2 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " + " + b1 + "x" + " = " + c2 + "\n" +
                    a1 + "x^2" + " - 0" + " + " + b1 + "x" + " - 0" + " + " + "0 - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + ")dx  и  " + "∫" + c2 + "dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + a1 + "x^2" + " + " + b1 + "x" + ")dx = (" + a1 + " * x^3) / 3 + (" + b1 + " * x^2) / 2" + "   " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + ")dx = " + "(" + b2 + " * x^2) / 2 + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3 + (" + b1 + " * " + x1 + "^2) / 2" + " = " + Fa + "   " + c2 + " * " + x1 + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3 + (" + b1 + " * " + x2 + "^2) / 2" + " = " + Fb + "   " + c2 + " * " + x2 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 == 0 && c1 != 0 && a2 != 0 && b2 != 0 && c2 != 0) //a 0 c = a b c ; x1 = a ; x2 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " + " + c1 + " = " + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + "\n" +
                    a1 + "x^2" + " - " + a2 + "x^2" + " + " + "0 - " + b2 + "x" + " + " + c1 + " - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + a1 + "x^2" + " + " + c1 + ")dx  и  " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + a1 + "x^2" + " + " + c1 + ")dx = (" + a1 + " * x^3) / 3" + " + " + c1 + "x   " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + ")dx = (" + a2 + " * x^3) / 3 + (" + b2 + " * x^2) / 2 + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3" + " + " + c1 + " * " + x1 + " = " + Fa + "   (" + a2 + " * " + x1 + "^3) / 3 + (" + b2 + " * " + x1 + "^2) / 2 + " + c2 + " * " + x1 + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3" + " + " + c1 + " * " + x2 + " = " + Fb + "   (" + a2 + " * " + x2 + "^3) / 3 + (" + b2 + " * " + x2 + "^2) / 2 + " + c2 + " * " + x2 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 == 0 && c1 != 0 && a2 != 0 && b2 != 0 && c2 == 0) //a 0 c = a b 0 ; x1 = a ; x2 = b //
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " + " + c1 + " = " + a2 + "x^2" + " + " + b2 + "x" + "\n" +
                    a1 + "x^2" + " - " + a2 + "x^2" + " + " + "0 - " + b2 + "x" + " + " + c1 + " - 0" + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + a1 + "x^2" + " + " + c1 + ")dx  и  " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + a1 + "x^2" + " + " + c1 + ")dx = (" + a1 + " * x^3) / 3" + " + " + c1 + "x   " + "∫(" + a2 + "x^2" + " + " + b2 + ")dx = (" + a2 + " * x^3) / 3 + (" + b2 + " * x^2) / 2" + "\n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3" + " + " + c1 + " * " + x1 + " = " + Fa + "   (" + a2 + " * " + x1 + "^3) / 3 + (" + b2 + " * " + x1 + "^2) / 2" + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3" + " + " + c1 + " * " + x2 + " = " + Fb + "   (" + a2 + " * " + x2 + "^3) / 3 + (" + b2 + " * " + x2 + "^2) / 2" + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 == 0 && c1 != 0 && a2 != 0 && b2 == 0 && c2 != 0) //a 0 c = a 0 c ; x1 = a ; x2 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " + " + c1 + " = " + a2 + "x^2" + " + " + c2 + "\n" +
                    a1 + "x^2" + " - " + a2 + "x^2" + " + " + "0 - 0" + " + " + c1 + " - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + a1 + "x^2" + " + " + c1 + ")dx  и  " + "∫(" + a2 + "x^2" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + a1 + "x^2" + " + " + c1 + ")dx = (" + a1 + " * x^3) / 3" + " + " + c1 + "x   " + "∫(" + a2 + "x^2" + " + " + c2 + ")dx = (" + a2 + " * x^3) / 3" + " + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3" + " + " + c1 + " * " + x1 + " = " + Fa + "   (" + a2 + " * " + x1 + "^3) / 3" + " + " + c2 + " * " + x1 + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3" + " + " + c1 + " * " + x2 + " = " + Fb + "   (" + a2 + " * " + x2 + "^3) / 3" + " + " + c2 + " * " + x2 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 == 0 && c1 != 0 && a2 == 0 && b2 != 0 && c2 != 0) //a 0 c = 0 b c ; x1 = a ; x2 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " + " + c1 + " = " + b2 + "x" + " + " + c2 + "\n" +
                    a1 + "x^2" + " - 0" + " + " + "0 - " + b2 + "x" + " + " + c1 + " - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + a1 + "x^2" + " + " + c1 + ")dx  и  " + "∫(" + b2 + "x" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + a1 + "x^2" + " + " + c1 + ")dx = (" + a1 + " * x^3) / 3" + " + " + c1 + "x   " + "∫(" + b2 + "x" + " + " + c2 + ")dx = " + "(" + b2 + " * x^2) / 2 + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3" + " + " + c1 + " * " + x1 + " = " + Fa + "   " + "(" + b2 + " * " + x1 + "^2) / 2 + " + c2 + " * " + x1 + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3" + " + " + c1 + " * " + x2 + " = " + Fb + "   " + "(" + b2 + " * " + x2 + "^2) / 2 + " + c2 + " * " + x2 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 == 0 && c1 != 0 && a2 != 0 && b2 == 0 && c2 == 0) //a 0 c = a 0 0 ; x1 = a ; x2 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " + " + c1 + " = " + a2 + "x^2" + "\n" +
                    a1 + "x^2" + " - " + a2 + "x^2" + " + " + "0 - 0" + " + " + c1 + " - 0" + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + a1 + "x^2" + " + " + c1 + ")dx  и  " + "∫" + a2 + "x^2" + "dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + a1 + "x^2" + " + " + c1 + ")dx = (" + a1 + " * x^3) / 3" + " + " + c1 + "x   " + "∫" + a2 + "x^2" + "dx = (" + a2 + " * x^3) / 3" + "\n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3" + " + " + c1 + " * " + x1 + " = " + Fa + "   (" + a2 + " * " + x1 + "^3) / 3" + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3" + " + " + c1 + " * " + x2 + " = " + Fb + "   (" + a2 + " * " + x2 + "^3) / 3" + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 == 0 && c1 != 0 && a2 == 0 && b2 != 0 && c2 == 0) //a 0 c = 0 b 0 ; x1 = a ; x2 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " + " + c1 + " = " + c2 + "\n" +
                    a1 + "x^2" + " - 0" + " + " + "0 - " + b2 + "x" + " + " + c1 + " - 0" + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + a1 + "x^2" + " + " + c1 + ")dx  и  " + "∫" + b2 + "x" + "dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + a1 + "x^2" + " + " + c1 + ")dx = (" + a1 + " * x^3) / 3" + " + " + c1 + "x   " + "∫" + b2 + "x" + "dx = " + "(" + b2 + " * x^2) / 2 + " + "\n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3" + " + " + c1 + " * " + x1 + " = " + Fa + "   " + "(" + b2 + " * " + x1 + "^2) / 2" + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3" + " + " + c1 + " * " + x2 + " = " + Fb + "   " + "(" + b2 + " * " + x2 + "^2) / 2" + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 == 0 && c1 != 0 && a2 == 0 && b2 == 0 && c2 != 0) //a 0 c = 0 0 c ; x1 = a ; x2 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " + " + c1 + " = " + c2 + "\n" +
                    a1 + "x^2" + " - 0" + " + " + "0 - 0" + " + " + c1 + " - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + a1 + "x^2" + " + " + c1 + ")dx  и  " + "∫" + c2 + "dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + a1 + "x^2" + " + " + c1 + ")dx = (" + a1 + " * x^3) / 3" + " + " + c1 + "x   " + "∫" + c2 + "dx = " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3" + " + " + c1 + " * " + x1 + " = " + Fa + "   " + c2 + " * " + x1 + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3" + " + " + c1 + " * " + x2 + " = " + Fb + "   " + c2 + " * " + x2 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 == 0 && c1 == 0 && a2 != 0 && b2 != 0 && c2 != 0) // a 0 0 = a b c  ; x1 = a ; x2 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " = " + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + "\n" +
                    a1 + "x^2" + " - " + a2 + "x^2" + " + " + "0 - " + b2 + "x" + " + " + "0 - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫" + a1 + "x^2" + "dx  и  " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫" + a1 + "x^2" + "dx = (" + a1 + " * x^3) / 3" + "   " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + ")dx = (" + a2 + " * x^3) / 3 + (" + b2 + " * x^2) / 2 + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3" + " = " + Fa + "   (" + a2 + " * " + x1 + "^3) / 3 + (" + b2 + " * " + x1 + "^2) / 2 + " + c2 + " * " + x1 + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3" + " = " + Fb + "   (" + a2 + " * " + x2 + "^3) / 3 + (" + b2 + " * " + x2 + "^2) / 2 + " + c2 + " * " + x2 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 == 0 && c1 == 0 && a2 != 0 && b2 != 0 && c2 == 0) // a 0 0 = a b 0  ; x1 = a ; x2 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " = " + a2 + "x^2" + " + " + b2 + "x" + "\n" +
                    a1 + "x^2" + " - " + a2 + "x^2" + " + " + "0 - " + b2 + "x" + " + " + "0 - 0" + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫" + a1 + "x^2" + "dx  и  " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫" + a1 + "x^2" + "dx = (" + a1 + " * x^3) / 3" + "   " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + ")dx = (" + a2 + " * x^3) / 3 + (" + b2 + " * x^2) / 2" + "\n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3" + " = " + Fa + "   (" + a2 + " * " + x1 + "^3) / 3 + (" + b2 + " * " + x1 + "^2) / 2" + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3" + " = " + Fb + "   (" + a2 + " * " + x2 + "^3) / 3 + (" + b2 + " * " + x2 + "^2) / 2" + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 == 0 && c1 == 0 && a2 != 0 && b2 == 0 && c2 != 0) // a 0 0 = a 0 c  ; x1 = a ; x2 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " = " + a2 + "x^2" + " + " + c2 + "\n" +
                    a1 + "x^2" + " - " + a2 + "x^2" + " + " + "0 - 0" + " + " + "0 - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫" + a1 + "x^2" + "dx  и  " + "∫(" + a2 + "x^2" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫" + a1 + "x^2" + "dx = (" + a1 + " * x^3) / 3" + "   " + "∫(" + a2 + "x^2" + " + " + c2 + ")dx = (" + a2 + " * x^3) / 3" + " + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3" + " = " + Fa + "   (" + a2 + " * " + x1 + "^3) / 3" + " + " + c2 + " * " + x1 + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3" + " = " + Fb + "   (" + a2 + " * " + x2 + "^3) / 3" + " + " + c2 + " * " + x2 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 == 0 && c1 == 0 && a2 == 0 && b2 != 0 && c2 != 0) // a 0 0 = 0 b c  ; x1 = a ; x2 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " = " + b2 + "x" + " + " + c2 + "\n" +
                    a1 + "x^2" + " - 0" + " + " + "0 - " + b2 + "x" + " + " + "0 - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫" + a1 + "x^2" + "dx  и  " + "∫(" + b2 + "x" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫" + a1 + "x^2" + "dx = (" + a1 + " * x^3) / 3" + "   " + "∫(" + b2 + "x" + " + " + c2 + ")dx = " + "(" + b2 + " * x^2) / 2 + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3" + " = " + Fa + "   " + "(" + b2 + " * " + x1 + "^2) / 2 + " + c2 + " * " + x1 + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3" + " = " + Fb + "   " + "(" + b2 + " * " + x2 + "^2) / 2 + " + c2 + " * " + x2 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 == 0 && c1 == 0 && a2 != 0 && b2 == 0 && c2 == 0) // a 0 0 = a 0 0  ; x1 = a ; x2 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " = " + a2 + "x^2" + "\n" +
                    a1 + "x^2" + " - " + a2 + "x^2" + " + " + "0 - 0" + " + " + "0 - 0" + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫" + a1 + "x^2" + "dx  и  " + "∫" + a2 + "x^2" + "dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫" + a1 + "x^2" + "dx = (" + a1 + " * x^3) / 3" + "   " + "∫" + a2 + "x^2" + "dx = (" + a2 + " * x^3) / 3" + "\n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3" + " = " + Fa + "   (" + a2 + " * " + x1 + "^3) / 3" + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3" + " = " + Fb + "   (" + a2 + " * " + x2 + "^3) / 3" + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 == 0 && c1 == 0 && a2 == 0 && b2 != 0 && c2 == 0) // a 0 0 = 0 b 0  ; x1 = a ; x2 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " = " + b2 + "x" + "\n" +
                    a1 + "x^2" + " - 0" + " + " + "0 - " + b2 + "x" + " + " + "0 - 0" + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫" + a1 + "x^2" + "dx  и  " + "∫" + b2 + "x" + "dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫" + a1 + "x^2" + "dx = (" + a1 + " * x^3) / 3" + "   " + "∫" + b2 + "x" + "dx = " + "(" + b2 + " * x^2) / 2" + "\n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3" + " = " + Fa + "   " + "(" + b2 + " * " + x1 + "^2) / 2" + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3" + " = " + Fb + "   " + "(" + b2 + " * " + x2 + "^2) / 2" + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 != 0 && b1 == 0 && c1 == 0 && a2 == 0 && b2 == 0 && c2 != 0) // a 0 0 = 0 0 c  ; x1 = a ; x2 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    a1 + "x^2" + " = " + c2 + "\n" +
                    a1 + "x^2" + " - 0" + " + " + "0 - 0" + " + " + "0 - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫" + a1 + "x^2" + "dx  и  " + "∫" + c2 + "dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫" + a1 + "x^2" + "dx = (" + a1 + " * x^3) / 3" + "   " + "∫" + b2 + "x" + "dx = " + "(" + b2 + " * x^2) / 2" + "\n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + a1 + " * " + x1 + "^3) / 3" + " = " + Fa + "   " + " + (" + b2 + " * " + x1 + "^2) / 2" + " = " + Ga + "\n" +
                    "(" + a1 + " * " + x2 + "^3) / 3" + " = " + Fb + "   " + " + (" + b2 + " * " + x2 + "^2) / 2" + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 == 0 && b1 != 0 && c1 != 0 && a2 != 0 && b2 != 0 && c2 != 0) // 0 b c = a b c ; x1 = a ; x2 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    b1 + "x" + " + " + c1 + " = " + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + "\n" +
                    "0 - " + a2 + "x^2" + " + " + b1 + "x" + " - " + b2 + "x" + " + " + c1 + " - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + b1 + "x" + " + " + c1 + ")dx  и  " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + b1 + "x" + " + " + c1 + ")dx = (" + b1 + " * x^2) / 2 + " + c1 + "x   " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + ")dx = (" + a2 + " * x^3) / 3 + (" + b2 + " * x^2) / 2 + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + b1 + " * " + x1 + "^2) / 2 + " + c1 + " * " + x1 + " = " + Fa + "   (" + a2 + " * " + x1 + "^3) / 3 + (" + b2 + " * " + x1 + "^2) / 2 + " + c2 + " * " + x1 + " = " + Ga + "\n" +
                    "(" + b1 + " * " + x2 + "^2) / 2 + " + c1 + " * " + x2 + " = " + Fb + "   (" + a2 + " * " + x2 + "^3) / 3 + (" + b2 + " * " + x2 + "^2) / 2 + " + c2 + " * " + x2 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 == 0 && b1 != 0 && c1 == 0 && a2 != 0 && b2 != 0 && c2 != 0) // 0 b 0 = a b c  ; x1 = a ; x2 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    b1 + "x" + " = " + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + "\n" +
                    "0 - " + a2 + "x^2" + " + " + b1 + "x" + " - " + b2 + "x" + " + " + "0 - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫" + b1 + "x" + "dx  и  " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫" + b1 + "x" + "dx = (" + b1 + " * x^2) / 2" + "   " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + ")dx = (" + a2 + " * x^3) / 3 + (" + b2 + " * x^2) / 2 + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + b1 + " * " + x1 + "^2) / 2 + " + " = " + Fa + "   (" + a2 + " * " + x1 + "^3) / 3 + (" + b2 + " * " + x1 + "^2) / 2 + " + c2 + " * " + x1 + " = " + Ga + "\n" +
                    "(" + b1 + " * " + x2 + "^2) / 2 + " + " = " + Fb + "   (" + a2 + " * " + x2 + "^3) / 3 + (" + b2 + " * " + x2 + "^2) / 2 + " + c2 + " * " + x2 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 == 0 && b1 == 0 && c1 != 0 && a2 != 0 && b2 != 0 && c2 != 0) // 0 0 c = a b c  ; x1 = a ; x2 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    c1 + " = " + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + "\n" +
                    "0 - " + a2 + "x^2" + " + " + "0 - " + b2 + "x" + " + " + c1 + " - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫" + c1 + "dx  и  " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫" + c1 + "dx = " + c1 + "x   " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + " + " + c2 + ")dx = (" + a2 + " * x^3) / 3 + (" + b2 + " * x^2) / 2 + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    c1 + " * " + x1 + " = " + Fa + "   (" + a2 + " * " + x1 + "^3) / 3 + (" + b2 + " * " + x1 + "^2) / 2 + " + c2 + " * " + x1 + " = " + Ga + "\n" +
                    c1 + " * " + x2 + " = " + Fb + "   (" + a2 + " * " + x2 + "^3) / 3 + (" + b2 + " * " + x2 + "^2) / 2 + " + c2 + " * " + x2 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 == 0 && b1 != 0 && c1 != 0 && a2 != 0 && b2 != 0 && c2 == 0) // 0 b c = a b 0 ; x1 = a ; x2 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    b1 + "x" + " + " + c1 + " = " + a2 + "x^2" + " + " + b2 + "x" + "\n" +
                    "0 - " + a2 + "x^2" + " + " + b1 + "x" + " - " + b2 + "x" + " + " + c1 + " - 0" + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + b1 + "x" + " + " + c1 + ")dx  и  " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + b1 + "x" + " + " + c1 + ")dx = (" + b1 + " * x^2) / 2 + " + c1 + "x   " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + ")dx = (" + a2 + " * x^3) / 3 + (" + b2 + " * x^2) / 2" + "\n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + b1 + " * " + x1 + "^2) / 2 + " + c1 + " * " + x1 + " = " + Fa + "   (" + a2 + " * " + x1 + "^3) / 3 + (" + b2 + " * " + x1 + "^2) / 2" + " = " + Ga + "\n" +
                    "(" + b1 + " * " + x2 + "^2) / 2 + " + c1 + " * " + x2 + " = " + Fb + "   (" + a2 + " * " + x2 + "^3) / 3 + (" + b2 + " * " + x2 + "^2) / 2" + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 == 0 && b1 != 0 && c1 == 0 && a2 != 0 && b2 != 0 && c2 == 0) // 0 b 0 = a b 0  ; x1 = a ; x2 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    b1 + "x" + " = " + a2 + "x^2" + " + " + b2 + "x" + "\n" +
                    "0 - " + a2 + "x^2" + " + " + b1 + "x" + " - " + b2 + "x" + " + " + "0 - 0" + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫" + b1 + "x" + "dx  и  " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫" + b1 + "x" + "dx = (" + b1 + " * x^2) / 2" + "   " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + ")dx = (" + a2 + " * x^3) / 3 + (" + b2 + " * x^2) / 2" + "\n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + b1 + " * " + x1 + "^2) / 2 + " + " = " + Fa + "   (" + a2 + " * " + x1 + "^3) / 3 + (" + b2 + " * " + x1 + "^2) / 2" + " = " + Ga + "\n" +
                    "(" + b1 + " * " + x2 + "^2) / 2 + " + " = " + Fb + "   (" + a2 + " * " + x2 + "^3) / 3 + (" + b2 + " * " + x2 + "^2) / 2" + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 == 0 && b1 == 0 && c1 != 0 && a2 != 0 && b2 != 0 && c2 != 0) // 0 0 c = a b 0  ; x1 = a ; x2 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    c1 + " = " + a2 + "x^2" + " + " + b2 + "x" + "\n" +
                    "0 - " + a2 + "x^2" + " + " + "0 - " + b2 + "x" + " + " + c1 + " - 0" + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫" + c1 + "dx  и  " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫" + c1 + "dx = " + c1 + "x   " + "∫(" + a2 + "x^2" + " + " + b2 + "x" + ")dx = (" + a2 + " * x^3) / 3 + (" + b2 + " * x^2) / 2" + "\n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    c1 + " * " + x1 + " = " + Fa + "   (" + a2 + " * " + x1 + "^3) / 3 + (" + b2 + " * " + x1 + "^2) / 2" + " = " + Ga + "\n" +
                    c1 + " * " + x2 + " = " + Fb + "   (" + a2 + " * " + x2 + "^3) / 3 + (" + b2 + " * " + x2 + "^2) / 2" + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 == 0 && b1 != 0 && c1 != 0 && a2 != 0 && b2 == 0 && c2 != 0) // 0 b c = a 0 c ; x1 = a ; x2 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    b1 + "x" + " + " + c1 + " = " + a2 + "x^2" + " + " + c2 + "\n" +
                    "0 - " + a2 + "x^2" + " + " + b1 + "x" + " - 0" + " + " + c1 + " - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + b1 + "x" + " + " + c1 + ")dx  и  " + "∫(" + a2 + "x^2" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + b1 + "x" + " + " + c1 + ")dx = (" + b1 + " * x^2) / 2 + " + c1 + "x   " + "∫(" + a2 + "x^2" + " + " + c2 + ")dx = (" + a2 + " * x^3) / 3" + " + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + b1 + " * " + x1 + "^2) / 2 + " + c1 + " * " + x1 + " = " + Fa + "   (" + a2 + " * " + x1 + "^3) / 3" + " + " + c2 + " * " + x1 + " = " + Ga + "\n" +
                    "(" + b1 + " * " + x2 + "^2) / 2 + " + c1 + " * " + x2 + " = " + Fb + "   (" + a2 + " * " + x2 + "^3) / 3" + " + " + c2 + " * " + x2 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 == 0 && b1 != 0 && c1 == 0 && a2 != 0 && b2 == 0 && c2 != 0) // 0 b 0 = a 0 c  ; x1 = a ; x2 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    b1 + "x" + " = " + a2 + "x^2" + " + " + c2 + "\n" +
                    "0 - " + a2 + "x^2" + " + " + b1 + "x" + " - 0" + " + " + "0 - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫" + b1 + "x" + "dx  и  " + "∫(" + a2 + "x^2" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫" + b1 + "x" + "dx = (" + b1 + " * x^2) / 2" + "   " + "∫(" + a2 + "x^2" + " + " + c2 + ")dx = (" + a2 + " * x^3) / 3" + " + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + b1 + " * " + x1 + "^2) / 2 + " + " = " + Fa + "   (" + a2 + " * " + x1 + "^3) / 3" + " + " + c2 + " * " + x1 + " = " + Ga + "\n" +
                    "(" + b1 + " * " + x2 + "^2) / 2 + " + " = " + Fb + "   (" + a2 + " * " + x2 + "^3) / 3" + " + " + c2 + " * " + x2 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 == 0 && b1 == 0 && c1 != 0 && a2 != 0 && b2 == 0 && c2 != 0) // 0 0 c = a 0 c  ; x1 = a ; x2 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    c1 + " = " + a2 + "x^2" + " + " + c2 + "\n" +
                    "0 - " + a2 + "x^2" + " + " + "0 - 0" + " + " + c1 + " - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫" + c1 + "dx  и  " + "∫(" + a2 + "x^2" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫" + c1 + "dx = " + c1 + "x   " + "∫(" + a2 + "x^2" + " + " + c2 + ")dx = (" + a2 + " * x^3) / 3" + " + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    c1 + " * " + x1 + " = " + Fa + "   (" + a2 + " * " + x1 + "^3) / 3" + " + " + c2 + " * " + x1 + " = " + Ga + "\n" +
                    c1 + " * " + x2 + " = " + Fb + "   (" + a2 + " * " + x2 + "^3) / 3" + " + " + c2 + " * " + x2 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 == 0 && b1 != 0 && c1 != 0 && a2 == 0 && b2 != 0 && c2 != 0) // 0 b c = 0 b c ; x1 = a ; x2 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    b1 + "x" + " + " + c1 + " = " + b2 + "x" + " + " + c2 + "\n" +
                    "0 - 0" + " + " + b1 + "x" + " - " + b2 + "x" + " + " + c1 + " - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + b1 + "x" + " + " + c1 + ")dx  и  " + "∫(" + b2 + "x" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + b1 + "x" + " + " + c1 + ")dx = (" + b1 + " * x^2) / 2 + " + c1 + "x   " + "∫(" + b2 + "x" + " + " + c2 + ")dx = " + "(" + b2 + " * x^2) / 2 + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + b1 + " * " + x1 + "^2) / 2 + " + c1 + " * " + x1 + " = " + Fa + "   " + "(" + b2 + " * " + x1 + "^2) / 2 + " + c2 + " * " + x1 + " = " + Ga + "\n" +
                    "(" + b1 + " * " + x2 + "^2) / 2 + " + c1 + " * " + x2 + " = " + Fb + "   " + "(" + b2 + " * " + x2 + "^2) / 2 + " + c2 + " * " + x2 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 == 0 && b1 != 0 && c1 == 0 && a2 == 0 && b2 != 0 && c2 != 0) // 0 b 0 = 0 b c  ; x1 = a ; x2 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    b1 + "x" + " = " + " + " + b2 + "x" + " + " + c2 + "\n" +
                    "0 - 0" + " + " + b1 + "x" + " - " + b2 + "x" + " + " + "0 - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫" + b1 + "x" + "dx  и  " + "∫(" + b2 + "x" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫" + b1 + "x" + "dx = (" + b1 + " * x^2) / 2" + "   " + "∫(" + b2 + "x" + " + " + c2 + ")dx = " + "(" + b2 + " * x^2) / 2 + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + b1 + " * " + x1 + "^2) / 2 + " + " = " + Fa + "   " + "(" + b2 + " * " + x1 + "^2) / 2 + " + c2 + " * " + x1 + " = " + Ga + "\n" +
                    "(" + b1 + " * " + x2 + "^2) / 2 + " + " = " + Fb + "   " + "(" + b2 + " * " + x2 + "^2) / 2 + " + c2 + " * " + x2 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 == 0 && b1 == 0 && c1 != 0 && a2 == 0 && b2 != 0 && c2 != 0) // 0 0 c = 0 b c  ; x1 = a ; x2 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    c1 + " = " + b2 + "x" + " + " + c2 + "\n" +
                    "0 - 0" + " + " + "0 - " + b2 + "x" + " + " + c1 + " - " + c2 + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫" + c1 + "dx  и  " + "∫(" + b2 + "x" + " + " + c2 + ")dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫" + c1 + "dx = " + c1 + "x   " + "∫(" + b2 + "x" + " + " + c2 + ")dx = " + "(" + b2 + " * x^2) / 2 + " + c2 + "x \n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    c1 + " * " + x1 + " = " + Fa + "   " + "(" + b2 + " * " + x1 + "^2) / 2 + " + c2 + " * " + x1 + " = " + Ga + "\n" +
                    c1 + " * " + x2 + " = " + Fb + "   " + "(" + b2 + " * " + x2 + "^2) / 2 + " + c2 + " * " + x2 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 == 0 && b1 != 0 && c1 != 0 && a2 != 0 && b2 == 0 && c2 == 0) // 0 b c = a 0 0 ; x1 = a ; x2 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    b1 + "x" + " + " + c1 + " = " + a2 + "x^2" + "\n" +
                    "0 - " + a2 + "x^2" + " + " + b1 + "x" + " - 0" + " + " + c1 + " - 0" + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫(" + b1 + "x" + " + " + c1 + ")dx  и  " + "∫" + a2 + "x^2" + "dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫(" + b1 + "x" + " + " + c1 + ")dx = (" + b1 + " * x^2) / 2 + " + c1 + "x   " + "∫" + a2 + "x^2" + "dx = (" + a2 + " * x^3) / 3" + "\n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + b1 + " * " + x1 + "^2) / 2 + " + c1 + " * " + x1 + " = " + Fa + "   (" + a2 + " * " + x1 + "^3) / 3" + " = " + Ga + "\n" +
                    "(" + b1 + " * " + x2 + "^2) / 2 + " + c1 + " * " + x2 + " = " + Fb + "   (" + a2 + " * " + x2 + "^3) / 3" + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 == 0 && b1 != 0 && c1 == 0 && a2 != 0 && b2 == 0 && c2 == 0) // 0 b 0 = a 0 0  ; x1 = a ; x2 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    b1 + "x" + " = " + a2 + "x^2" + "\n" +
                    "0 - " + a2 + "x^2" + " + " + b1 + "x" + " - 0" + " + " + "0 - 0" + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫" + b1 + "x" + "dx  и  " + "∫" + a2 + "x^2" + "dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫" + b1 + "x" + "dx = (" + b1 + " * x^2) / 2" + "   " + "∫" + a2 + "x^2" + "dx = (" + a2 + " * x^3) / 3" + "\n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n\n" +
                    "(" + b1 + " * " + x1 + "^2) / 2 + " + " = " + Fa + "   (" + a2 + " * " + x1 + "^3) / 3" + " + " + c2 + " * " + x1 + " = " + Ga + "\n" +
                    "(" + b1 + " * " + x2 + "^2) / 2 + " + " = " + Fb + "   (" + a2 + " * " + x2 + "^3) / 3" + " + " + c2 + " * " + x2 + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
                else if (a1 == 0 && b1 == 0 && c1 != 0 && a2 != 0 && b2 == 0 && c2 == 0) // 0 0 c = a 0 0  ; x1 = a ; x2 = b
                {
                    MessageBox.Show(String.Format("Этап 1: Находим точки пересечения функций \n\n" +
                    c1 + " = " + a2 + "x^2" + "\n" +
                    "0 - " + a2 + "x^2" + " + " + "0 - 0" + " + " + c1 + " - 0" + "\n" +
                    a + "x^2" + " + " + b + "x" + " + " + c + " = 0" + "\n" +
                    "Дискриминант: " + b + "^2 - 4 * " + a + " * " + c + " = " + disc + "    √D = " + Math.Sqrt(disc) + "\n" +
                    "x1 = (" + -b + " - " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x1 + "x2 = (" + -b + " + " + Math.Sqrt(disc) + ") / (2 * " + a + ") = " + x2 + "\n" +
                    x1 + " и " + x2 + " являются точками пересечения функций и границами соответственно \n" +
                    "\nЭтап 2: Находим первообразные функций \n\n" +
                    "∫" + c1 + "dx  и  " + "∫" + a2 + "x^2" + "dx " + " при а = " + x2 + " и b = " + x1 + "\n" +
                    "∫" + c1 + "dx = " + c1 + "x   " + "∫" + a2 + "x^2" + "dx = (" + a2 + " * x^3) / 3" + "\n" +
                    "\nЭтап 3: Подставляем в первообразные верхний и нижний пределы \n" +
                    c1 + " * " + x1 + " = " + Fa + "   (" + a2 + " * " + x1 + "^3) / 3" + " = " + Ga + "\n" +
                    c1 + " * " + x2 + " = " + Fb + "   (" + a2 + " * " + x2 + "^3) / 3" + " = " + Gb + "\n" +
                    "\nЭтап 4: Вычисляем интегралы \n\n" +
                    Fb + " - " + Fa + " = " + Integral1 + "    " + Gb + " - " + Ga + " = " + Integral2 + "\n" +
                    "\nЭтап 5: Вычисляем площадь фигуры \n\n" +
                    Integral1 + " - " + Integral2 + " = " + Figure + "\n" +
                    Figure + " и является площадью заданной фигуры"));
                }
            }
            else { MessageBox.Show("Некорректный ввод данных"); }
        }
        private void button3_Click(object sender, EventArgs e)
        {
            this.Hide();
            Functions form1 = new Functions();
            form1.Show();
        }

        private void buttonExpWord_Click(object sender, EventArgs e)
        {
            try
            {
                Word.Application wordApp = new Word.Application();
                wordApp.Visible = true;
                Word.Document doc = wordApp.Documents.Add();
                Word.Paragraph xs = doc.Content.Paragraphs.Add();
                xs.Range.Text = Convert.ToString(Figure);
            }
            catch
            {
                MessageBox.Show("Ошибка при экспорте");
            }
        }

        private void buttonExpExcel_Click(object sender, EventArgs e)
        {
            try
            {
                Excel.Application excelApp = new Excel.Application();
                excelApp.Visible = true;
                excelApp.Workbooks.Add();
                Excel.Workbook workbook = excelApp.Workbooks.Add();
                Excel.Worksheet worksheet = (Excel.Worksheet)excelApp.ActiveSheet;
                worksheet.Cells[1, 1] = Figure;
            }
            catch
            {
                MessageBox.Show("Ошибка при экспорте");
            }   
        }

        private void buttonImpWord_Click(object sender, EventArgs e)
        {

        }

        private void buttonImpExcel_Click(object sender, EventArgs e)
        {

        }
    }
}
